<?php
// +----------------------------------------------------------------------
// | HkCms admin应用基础配置
// +----------------------------------------------------------------------
// | Copyright (c) 2020-2021 http://www.hkcms.cn, All rights reserved.
// +----------------------------------------------------------------------
// | Author: 广州恒企教育科技有限公司 <admin@hkcms.cn>
// +----------------------------------------------------------------------

return [
    'form_type' => [
        'text' => '单行文本',
        'textarea' => '多行文本',
        'radio' => '单选',
        'checkbox' => '复选',
        'select' =>'下拉列表',
        'selects' => '下拉列表(多)',
        'selectpage'=>'动态下拉',
        'editor' => '编辑器',
        'image' =>'图片',
        'images' => '图片(多)',
        'number' =>'数字',
        'date' => '日期',
        'datetime' => '日期和时间',
        'downfile' => '文件上传',
        'downfiles' => '文件上传(多)',
        'array' => '数组(键值对)'
    ],
    'form_setting' => [
        'ext' => '', // 文件限制后缀
        'filesize' => '', // 文件大小配置
        'filter_option'=>'', // 筛选
        'default_value'=>'' // 默认值，里面二维数组，多语言
    ]
];